
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Инициализировать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбновитьТекстЗапросаПриИзмененииНастроеек(Элемент)
	
	ОбновитьТексты();
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПолейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элемент.ТекущиеДанные.Пометка = НЕ Элемент.ТекущиеДанные.Пометка;
	ОбновитьТексты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКадровыеДанныеСотрудников

&НаКлиенте
Процедура КадровыеДанныеСотрудников_УстановитьФлажки(Команда)
	
	ИзменитьФлажки(Элементы.КадровыеДанныеСотрудников_ТаблицаПолей, КадровыеДанныеСотрудников_ТаблицаПолей, Истина);
 	ОбновитьТексты();
	
КонецПроцедуры

&НаКлиенте
Процедура КадровыеДанныеСотрудников_СнятьФлажки(Команда)
	
	ИзменитьФлажки(Элементы.КадровыеДанныеСотрудников_ТаблицаПолей, КадровыеДанныеСотрудников_ТаблицаПолей, Ложь);
 	ОбновитьТексты();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКадровыеДанныеСотрудников

&НаКлиенте
Процедура ДанныеУчетаВремениИСостоянийСотрудников_УстановитьФлажки(Команда)
	
	ИзменитьФлажки(Элементы.ДанныеУчетаВремениИСостоянийСотрудников_ТаблицаПолей, ДанныеУчетаВремениИСостоянийСотрудников_ТаблицаПолей, Истина);
 	ОбновитьТексты();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеУчетаВремениИСостоянийСотрудников_СнятьФлажки(Команда)
	
	ИзменитьФлажки(Элементы.ДанныеУчетаВремениИСостоянийСотрудников_ТаблицаПолей, ДанныеУчетаВремениИСостоянийСотрудников_ТаблицаПолей, Ложь);
 	ОбновитьТексты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКадровыеДанныеСотрудников

&НаКлиенте
Процедура ШтатноеРасписание_УстановитьФлажки(Команда)

	ИзменитьФлажки(Элементы.ШтатноеРасписание_ТаблицаПолей, ШтатноеРасписание_ТаблицаПолей, Истина);
 	ОбновитьТексты();
	
КонецПроцедуры

&НаКлиенте
Процедура ШтатноеРасписание_СнятьФлажки(Команда)

	ИзменитьФлажки(Элементы.ШтатноеРасписание_ТаблицаПолей, ШтатноеРасписание_ТаблицаПолей, Ложь);
 	ОбновитьТексты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКадровыеДанныеСотрудников

&НаКлиенте
Процедура СрезПоследних_УстановитьФлажки(Команда)

	ИзменитьФлажки(Элементы.СрезПоследних_ТаблицаПолей, СрезПоследних_ТаблицаПолей, Истина);
 	ОбновитьТексты();
	
КонецПроцедуры

&НаКлиенте
Процедура СрезПоследних_СнятьФлажки(Команда)

	ИзменитьФлажки(Элементы.СрезПоследних_ТаблицаПолей, СрезПоследних_ТаблицаПолей, Ложь);
 	ОбновитьТексты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КонструкторЗапроса(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеИзмененияТекстаЗапроса", ЭтаФорма);
	
	Конструктор = Новый КонструкторЗапроса(ТекстЗапроса);
	Конструктор.РежимКомпоновкиДанных = Истина;
	Конструктор.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияТекстаЗапроса(Текст, ДополнительныеПараметры) Экспорт
	
	Если Текст <> Неопределено Тогда
		ТекстЗапроса = Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторФактическогоЗапроса(Команда)

	Конструктор = Новый("КонструкторЗапроса");
	Конструктор.Текст = ТекстФактическогоЗапроса;
	Конструктор.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекстФактическогоЗапроса(Команда)
	
	ОбновитьТекстФактическогоЗапросаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискШаблоновКода(Команда)
	
	ОткрытьФорму("ВнешняяОбработка.Представления_ЗУП.Форма.ФормаШаблоныКода");
	
КонецПроцедуры

#КонецОбласти

#Область Периоды

&НаСервере
Процедура Периоды_Инициаизировать()
	
	Периоды_ИспользоватьКонецПериода = Ложь;
	Периоды_НачалоИнтервала = "ДатаНачала";
	Периоды_ОкончаниеИнтервала = "ДатаОкончания";
	Периоды_Периодичность = "ДЕНЬ";
	Периоды_ДобавитьВыборкуСотрудников = Ложь;
	
КонецПроцедуры

&НаКлиенте
Функция Периоды_ТекстЗапроса()
	
	ШаблонЗапроса = 
	"ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Период
	|ПОМЕСТИТЬ Представления_Периоды
	|ГДЕ
	|	""НачалоИнтервала"" = &[НачалоИнтервала]
	|	И ""ОкончаниеИнтервала"" = &[ОкончаниеИнтервала]
	|	И ""Периодичность"" = ""[Периодичность]""
	|	И ""ИспользоватьКонецПериода"" = ""[ИспользоватьКонецПериода]""";
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("НачалоИнтервала", Периоды_НачалоИнтервала);
	ПараметрыЗапроса.Вставить("ОкончаниеИнтервала", Периоды_ОкончаниеИнтервала);
	ПараметрыЗапроса.Вставить("Периодичность", Периоды_Периодичность);
	ПараметрыЗапроса.Вставить("ИспользоватьКонецПериода", БулевоСтрокой(Периоды_ИспользоватьКонецПериода));
	
	ТекстПодзапроса = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонЗапроса, ПараметрыЗапроса);
	Возврат ТекстПодзапроса;
	
КонецФункции

&НаКлиенте
Функция Периоды_ТекстЗапросаВыборкиСотрудников()
	
	ШаблонЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	КОНЕЦПЕРИОДА(Представления_Периоды.Период, ДЕНЬ) КАК Период
	|ПОМЕСТИТЬ [ТаблицаДляПомещения]
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Представления_Периоды КАК Представления_Периоды
	|		ПО (ИСТИНА)
	|{ГДЕ
	|	Сотрудники.Ссылка.* КАК Сотрудник}";
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ТаблицаДляПомещения", КадровыеДанныеСотрудников_ИмяТаблицы);
	
	ТекстПодзапроса = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонЗапроса, ПараметрыЗапроса);
	Возврат ТекстПодзапроса;
	
КонецФункции

#КонецОбласти

#Область КадровыеДанныеСотрудников

&НаСервере
Процедура КадровыеДанныеСотрудников_Инициаизировать()
	
	ПоляПредставленийКадровыхДанных = КадровыйУчет.ПоляПредставленийКадровыхДанныхСотрудников();
	КадровыеДанныеСотрудников_ТаблицаПолей.Загрузить(ПоляПредставленийКадровыхДанных);
	Для каждого Строка Из КадровыеДанныеСотрудников_ТаблицаПолей Цикл
		Строка.ВРегИмяПоля = ВРег(Строка.ИмяПоля);
	КонецЦикла; 
	
	КадровыеДанныеСотрудников_ТолькоРазрешенные = Истина;
	КадровыеДанныеСотрудников_ФормироватьСПериодичностьДень = Истина;
	КадровыеДанныеСотрудников_ИмяТаблицы = "ВТСотрудники";
	КадровыеДанныеСотрудников_ТаблицаДляПомещения = "Представления_КадровыеДанныеСотрудников";
	
КонецПроцедуры

&НаКлиенте
Функция КадровыеДанныеСотрудников_ТекстЗапроса()
	
	ШаблонЗапроса = 
	"ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
	|[СтрокаРеквизитов]
	|ПОМЕСТИТЬ [ТаблицаДляПомещения]
	|ИЗ
	|	[ИмяТаблицы] КАК [ИмяТаблицы]
	|ГДЕ
	|	[СтрокаПараметров]";
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИмяТаблицы", КадровыеДанныеСотрудников_ИмяТаблицы);
	ПараметрыЗапроса.Вставить("ТаблицаДляПомещения", КадровыеДанныеСотрудников_ТаблицаДляПомещения);
	ПараметрыЗапроса.Вставить("СтрокаРеквизитов", СтрокаРеквизитов(КадровыеДанныеСотрудников_ТаблицаПолей));
	ПараметрыЗапроса.Вставить("СтрокаПараметров", КадровыеДанныеСотрудников_СтрокаПараметров());
	
	ТекстПодзапроса = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонЗапроса, ПараметрыЗапроса);
	Возврат ТекстПодзапроса;
	
КонецФункции

&НаКлиенте
Функция КадровыеДанныеСотрудников_СтрокаПараметров()

	ЗначенияПараметров = Новый Структура;
	
	ТолькоРазрешенные = БулевоСтрокой(КадровыеДанныеСотрудников_ТолькоРазрешенные);
	ЗначенияПараметров.Вставить("ТолькоРазрешенные", ТолькоРазрешенные);
	
	Если НЕ КадровыеДанныеСотрудников_ФормироватьСПериодичностьДень Тогда
		ЗначенияПараметров.Вставить("ФормироватьСПериодичностьДень", "ЛОЖЬ");
	КонецЕсли;
	
	СтрокаПараметров = СтрокаПараметров(ЗначенияПараметров);
	Возврат СтрокаПараметров;
	
КонецФункции

&НаКлиенте
Функция КадровыеДанныеСотрудников_ШаблонКода()
	
	ШаблонКода = 
	"	ИмяВТКадровыеДанныеСотрудников = ""[ИмяТаблицы]"";
	|	ИмяВТОтборовСотрудников = ""[ТаблицаДляПомещения]"";
	|	КадровыеДанные = ""[СтрокаРеквизитов]"";
	|
	|	ОписательВТ = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(МенеджерВременныхТаблиц, ИмяВТОтборовСотрудников);
	|	ОписательВТ.ИмяВТКадровыеДанныеСотрудников = ИмяВТКадровыеДанныеСотрудников;
	|	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВТ, Истина, КадровыеДанные)";
	
	МассивСтрок = Новый Массив;
	Отбор = Новый Структура("Пометка", Истина);
	Для каждого Строка Из КадровыеДанныеСотрудников_ТаблицаПолей.НайтиСтроки(Отбор) Цикл
		МассивСтрок.Добавить(Строка.ИмяПоля);
	КонецЦикла;
	СтрокаРеквизитов = СтрСоединить(МассивСтрок, ", ");
	
	ПараметрыШаблона = Новый Структура;
	ПараметрыШаблона.Вставить("ИмяТаблицы", КадровыеДанныеСотрудников_ИмяТаблицы);
	ПараметрыШаблона.Вставить("ТаблицаДляПомещения", КадровыеДанныеСотрудников_ТаблицаДляПомещения);
	ПараметрыШаблона.Вставить("СтрокаРеквизитов", СтрокаРеквизитов);
	
	ШаблонКода = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонКода, ПараметрыШаблона);
	Возврат ШаблонКода;
	
КонецФункции

#КонецОбласти

#Область ДанныеУчетаВремениИСостоянийСотрудников

&НаСервере
Процедура ДанныеУчетаВремениИСостоянийСотрудников_Инициаизировать()
	
	Обновить_ДанныеУчетаВремениИСостоянийСотрудников_ТаблицаПолей();
	
	ДанныеУчетаВремениИСостоянийСотрудников_ТолькоРазрешенные = Истина;
	ДанныеУчетаВремениИСостоянийСотрудников_МесяцДатаОкончания = "МесяцДатаОкончания";
	ДанныеУчетаВремениИСостоянийСотрудников_МесяцДатаНачала = "МесяцДатаНачала";
	ДанныеУчетаВремениИСостоянийСотрудников_ДатаОкончания = "ДатаОкончания";
	ДанныеУчетаВремениИСостоянийСотрудников_ДатаНачала = "ДатаНачала";
	ДанныеУчетаВремениИСостоянийСотрудников_ДатаАктуальности = "ДатаАктуальности";
	ДанныеУчетаВремениИСостоянийСотрудников_РассчитыватьПлановоеВремя = "РассчитыватьПлановоеВремя";
	
КонецПроцедуры

&НаСервере
Процедура Обновить_ДанныеУчетаВремениИСостоянийСотрудников_ТаблицаПолей()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОписаниеПолей = ОбработкаОбъект.ОписаниеПолейПредставления_ДанныеУчетаВремениИСостоянийСотрудников();
	ДанныеУчетаВремениИСостоянийСотрудников_ТаблицаПолей.Загрузить(ОписаниеПолей);
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеУчетаВремениИСостоянийСотрудников_ТекстЗапроса()
	
	ШаблонЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&[ДатаНачала] КАК ДатаНачала,
	|	&[ДатаОкончания] КАК ДатаОкончания,
	|	Сотрудники.Ссылка КАК Сотрудник
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|{ГДЕ
	|	Сотрудники.Ссылка.* КАК Сотрудник}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|[СтрокаРеквизитов]
	|ПОМЕСТИТЬ Представления_ДанныеУчетаВремениИСостоянийСотрудников
	|ИЗ
	|	ВТСотрудники КАК ВТСотрудники
	|ГДЕ
	|	""ТолькоРазрешенные"" = [ТолькоРазрешенные]
	|	И ""ДатаНачала"" = &[ДатаНачала]
	|	И ""ДатаОкончания"" = &[ДатаОкончания]
	|	И ""МесяцДатаНачала"" = &[МесяцДатаНачала]
	|	И ""МесяцДатаОкончания"" = &[МесяцДатаОкончания]
	|	И ""ДатаАктуальности"" = &[ДатаАктуальности]
	|	И ""РассчитыватьПлановоеВремя"" = &[РассчитыватьПлановоеВремя]";
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ТолькоРазрешенные", БулевоСтрокой(ДанныеУчетаВремениИСостоянийСотрудников_ТолькоРазрешенные));
	ПараметрыЗапроса.Вставить("ДатаНачала", ДанныеУчетаВремениИСостоянийСотрудников_ДатаНачала);
	ПараметрыЗапроса.Вставить("ДатаОкончания", ДанныеУчетаВремениИСостоянийСотрудников_ДатаОкончания);
	ПараметрыЗапроса.Вставить("МесяцДатаНачала", ДанныеУчетаВремениИСостоянийСотрудников_МесяцДатаНачала);
	ПараметрыЗапроса.Вставить("МесяцДатаОкончания", ДанныеУчетаВремениИСостоянийСотрудников_МесяцДатаОкончания);
	ПараметрыЗапроса.Вставить("ДатаАктуальности", ДанныеУчетаВремениИСостоянийСотрудников_ДатаАктуальности);
	ПараметрыЗапроса.Вставить("РассчитыватьПлановоеВремя", ДанныеУчетаВремениИСостоянийСотрудников_РассчитыватьПлановоеВремя);
	ПараметрыЗапроса.Вставить("СтрокаРеквизитов", СтрокаРеквизитов(ДанныеУчетаВремениИСостоянийСотрудников_ТаблицаПолей));
	
	ТекстПодзапроса = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонЗапроса, ПараметрыЗапроса);
	Возврат ТекстПодзапроса;
	
КонецФункции

#КонецОбласти

#Область ШтатноеРасписание

&НаСервере
Процедура ШтатноеРасписание_Инициаизировать()
	
	Обновить_ШтатноеРасписание_ТаблицаПолей();
	
	ШтатноеРасписание_ТолькоРазрешенные = Истина;
	ШтатноеРасписание_ВключатьНачисления = Ложь;
	ШтатноеРасписание_ДатаАктуальности = "ДатаАктуальности";
	
КонецПроцедуры

&НаКлиенте
Процедура ШтатноеРасписание_ВключатьНачисленияПриИзменении(Элемент)
	
	Обновить_ШтатноеРасписание_ТаблицаПолей();
	ОбновитьТексты();
	
КонецПроцедуры

&НаСервере
Процедура Обновить_ШтатноеРасписание_ТаблицаПолей()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОписаниеПолей = ОбработкаОбъект.ОписаниеПолейПредставления_ШтатноеРасписание(ШтатноеРасписание_ВключатьНачисления);
	ШтатноеРасписание_ТаблицаПолей.Загрузить(ОписаниеПолей);
	
КонецПроцедуры

&НаКлиенте
Функция ШтатноеРасписание_ТекстЗапроса()
	
	ШаблонЗапроса = 
	"ВЫБРАТЬ 
	|[СтрокаРеквизитов] 
	|ПОМЕСТИТЬ Представления_ШтатноеРасписание
	|ГДЕ
	|	""ТолькоРазрешенные"" = [ТолькоРазрешенные]
	|	И ""ДатаАктуальности"" = &[ДатаАктуальности]
	|	И ""ВключатьНачисления"" = [ВключатьНачисления]";
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ТолькоРазрешенные", БулевоСтрокой(ШтатноеРасписание_ТолькоРазрешенные));
	ПараметрыЗапроса.Вставить("ДатаАктуальности", БулевоСтрокой(ШтатноеРасписание_ДатаАктуальности));
	ПараметрыЗапроса.Вставить("ВключатьНачисления", БулевоСтрокой(ШтатноеРасписание_ВключатьНачисления));
	ПараметрыЗапроса.Вставить("СтрокаРеквизитов", СтрокаРеквизитов(ШтатноеРасписание_ТаблицаПолей));
	
	ТекстПодзапроса = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонЗапроса, ПараметрыЗапроса);
	Возврат ТекстПодзапроса;
	
КонецФункции

#КонецОбласти

#Область СрезПоследних

&НаСервере
Процедура СрезПоследних_Инициаизировать()
	
	СрезПоследних_ТолькоРазрешенные = Истина;
	
	Для каждого Регистр Из Метаданные.РегистрыСведений Цикл
		Если Строка(Регистр.ПериодичностьРегистраСведений) = "Непериодический" Тогда
			Продолжить;
		КонецЕсли;
		
		Элементы.СрезПоследних_ИмяРегистра.СписокВыбора.Добавить(Регистр.Имя);
	КонецЦикла;
	
КонецПроцедуры	
	
&НаКлиенте
Процедура СрезПоследних_ИмяРегистраПриИзменении(Элемент)
	
	Обновить_СрезПоследних_ТаблицаПолей();
	ОбновитьТексты();
	
КонецПроцедуры

&НаСервере
Процедура Обновить_СрезПоследних_ТаблицаПолей()
	
	Если ЗначениеЗаполнено(СрезПоследних_ИмяРегистра) Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОписаниеПолей = ОбработкаОбъект.ОписаниеПолейПредставления_СрезПоследних(СрезПоследних_ИмяРегистра);
		СрезПоследних_ТаблицаПолей.Загрузить(ОписаниеПолей);
	Иначе
		СрезПоследних_ТаблицаПолей.Очистить();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция СрезПоследних_ТекстЗапроса()
	
	ШаблонЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|[СтрокаРеквизитов] 
	|ПОМЕСТИТЬ Представления_СрезПоследних_[ИмяРегистра]
	|ИЗ
	|	[ИмяТаблицы] КАК [ИмяТаблицы]
	|ГДЕ
	|	""ТолькоРазрешенные"" = [ТолькоРазрешенные]";

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИмяРегистра", СрезПоследних_ИмяРегистра);
	ПараметрыЗапроса.Вставить("ИмяТаблицы", СрезПоследних_ИмяТаблицы);
	ПараметрыЗапроса.Вставить("СтрокаРеквизитов", СтрокаРеквизитов(СрезПоследних_ТаблицаПолей));
	ПараметрыЗапроса.Вставить("ТолькоРазрешенные", БулевоСтрокой(СрезПоследних_ТолькоРазрешенные));
	
	ТекстПодзапроса = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонЗапроса, ПараметрыЗапроса);
	Возврат ТекстПодзапроса;
	
КонецФункции

&НаКлиенте
Функция СрезПоследних_ШаблонКода()
	
	ШаблонКода = 
	"	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	|	
	|	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
	|		""[ИмяРегистра]"",
	|		Запрос.МенеджерВременныхТаблиц,
	|		Истина,
	|		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(...),
	|		ПараметрыПостроения);";
	
	ПараметрыШаблона = Новый Структура;
	ПараметрыШаблона.Вставить("ИмяРегистра", СрезПоследних_ИмяРегистра);
	
	ШаблонКода = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонКода, ПараметрыШаблона);
	Возврат ШаблонКода;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура Инициализировать()
	
	Периоды_Инициаизировать();
	КадровыеДанныеСотрудников_Инициаизировать();
	ДанныеУчетаВремениИСостоянийСотрудников_Инициаизировать();
	ШтатноеРасписание_Инициаизировать();
	СрезПоследних_Инициаизировать();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажки(ЭлементФормыТаблица, Таблица, Значение)
	
	ИдентификаторыСтрок = ЭлементФормыТаблица.ВыделенныеСтроки;
	Если ИдентификаторыСтрок.Количество() > 1 Тогда
		Строки = Новый Массив;
		Для каждого Идентификатор Из ИдентификаторыСтрок Цикл
			Строка = Таблица.НайтиПоИдентификатору(Идентификатор);
			Строки.Добавить(Строка);
		КонецЦикла;
	Иначе
		Строки = Таблица;
	КонецЕсли;
	
	Для каждого Строка Из Строки Цикл
		Строка.Пометка = Значение;
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТексты()
	
	ОбновитьТекстыЗапросов();
	ОбновитьШаблоныКода();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьШаблоныКода()
	
	Тексты = Новый Массив;
	
	Если КадровыеДанныеСотрудников_Использовать Тогда
		ШаблонКода = КадровыеДанныеСотрудников_ШаблонКода();
		Тексты.Добавить(ШаблонКода);
	КонецЕсли;

	Если СрезПоследних_Использовать Тогда
		ШаблонКода = СрезПоследних_ШаблонКода();
		Тексты.Добавить(ШаблонКода);
	КонецЕсли;
	
	Разделитель =
	"
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ШаблоныКода = СтрСоединить(Тексты, Разделитель);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекстыЗапросов()
	
	Тексты = Новый Массив;
	
	Если Периоды_Использовать Тогда
		ТекстПодзапроса = Периоды_ТекстЗапроса();
		Тексты.Добавить(ТекстПодзапроса);
		
		Если Периоды_ДобавитьВыборкуСотрудников Тогда
			ТекстПодзапроса = Периоды_ТекстЗапросаВыборкиСотрудников();
			Тексты.Добавить(ТекстПодзапроса);
		КонецЕсли;	
	КонецЕсли;
	
	Если КадровыеДанныеСотрудников_Использовать Тогда
		ТекстПодзапроса = КадровыеДанныеСотрудников_ТекстЗапроса();
		Тексты.Добавить(ТекстПодзапроса);
	КонецЕсли;
	
	Если ДанныеУчетаВремениИСостоянийСотрудников_Использовать Тогда
		ТекстПодзапроса = ДанныеУчетаВремениИСостоянийСотрудников_ТекстЗапроса();
		Тексты.Добавить(ТекстПодзапроса);
	КонецЕсли;
	
	Если ШтатноеРасписание_Использовать Тогда
		ТекстПодзапроса = ШтатноеРасписание_ТекстЗапроса();
		Тексты.Добавить(ТекстПодзапроса);
	КонецЕсли;

	Если СрезПоследних_Использовать Тогда
		ТекстПодзапроса = СрезПоследних_ТекстЗапроса();
		Тексты.Добавить(ТекстПодзапроса);
	КонецЕсли;
	
	Разделитель =
	"
	|;
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = СтрСоединить(Тексты, Разделитель);
	
КонецПроцедуры

&НаКлиенте
Функция СтрокаРеквизитов(ТаблицаОписанияПолей)
	
	МассивСтрок = Новый Массив;
	
	ШаблонСтроки = "	%1 КАК %2";
	
	Отбор = Новый Структура("Пометка", Истина);
	Для каждого Строка Из ТаблицаОписанияПолей.НайтиСтроки(Отбор) Цикл
		СтрокаЗапроса = СтрШаблон(ШаблонСтроки, Строка.ПустоеЗначениеНаЯзыкеЗапросов, Строка.ИмяПоля);
		МассивСтрок.Добавить(СтрокаЗапроса);
	КонецЦикла;
	
	Разделитель = "," + Символы.ПС;
	Результат = СтрСоединить(МассивСтрок, Разделитель);
	
	Возврат Результат;
	
КонецФункции	
	
&НаКлиенте
Функция СтрокаПараметров(ЗначенияПараметров)
	
	МассивСтрок = Новый Массив;
	ШаблонСтроки = """%1"" = %2";
	
	Для каждого Элемент Из ЗначенияПараметров Цикл
		Строка = СтрШаблон(ШаблонСтроки, Элемент.Ключ, Элемент.Значение);	
		МассивСтрок.Добавить(Строка);
	КонецЦикла; 
	
	Разделитель = Символы.ПС + "	И ";
	Результат = СтрСоединить(МассивСтрок, Разделитель);
	
	Возврат Результат;
	
КонецФункции
	
&НаКлиенте
Функция БулевоСтрокой(Значение)
	
	Возврат Формат(Значение, "БЛ=ЛОЖЬ; БИ=ИСТИНА");

КонецФункции

&НаСервере
Процедура ОбновитьТекстФактическогоЗапросаНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТекстФактическогоЗапроса = ОбработкаОбъект.ТекстФактическогоЗапроса(ТекстЗапроса);
	
КонецПроцедуры

#КонецОбласти

